GREETING = (
    'Бар \"Меграт\" открыт и готов принимать посетителей!'
    '\nИспользуйте `!помощь`, чтобы ознакомиться с правилами бара.'
)

REGULAR_SHOT = '**{discord_name}** выпил ананаги и отправился в вытрезвитель на {mute_seconds}.'
STRONG_SHOT = (
    '**{discord_name}** кончил две бутылки особо крепкой ананаги '
    'и отправился в вытрезвитель на {mute_seconds}.'
)
BACK_TO_BAR = 'сможет вернуться в наш бар'

NO_RECORD = (
    'Кажется, у тебя ещё нет нашей карты лояльности. '
    'Скорее выпей бокальчик и получи её!'
)

HELP_MESSAGE = (
    'В нашем баре вы можете:\n\n'
    '* `!выпил` - выпить ананаги '
    '(случайный эффект от 1 секунды до 24 часов)\n'
    '* `!кончил` - выпить очень крепкой ананаги '
    '(гарантированный эффект на 48 часов)\n'
    '* `!лояльность` - ознакомиться со своей картой лояльности\n'
    '* `!рейтинг` - посмотреть список почётных клиентов бара "Меграт"'
)

NO_MORE_ANANAGA = 'Ты уже и так выпил слишком много ананаги.'

MORE_THAN_ONE_COMMAND = (
    'Друг, ты просишь от меня слишком многого! '
    'Давай по одной команде за раз.'
)

NO_HONORED = 'Кажется, в баре ещё не было ни одного посетителя. Так пусто...'

USER_STAT = "Бокалов выпито: {shots_count}\nВремени под ананагой: {drunk_time}."

HONORED_DRUNKARDS = (
    "**Дольше всех под ананагой:**\n{longest_drunkards}\n\n"
    "**Чаще других в вытрезвителе:**\n{fastest_drunkards}"
)
